; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 GroundStation0)
	(have_image Star5 image1)
	(have_image Star6 image1)
	(have_image Star7 thermograph0)
	(have_image Planet9 infrared2)
	(have_image Planet10 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 7
4. (turn_to satellite0 star5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star5)
   goals met: 1 of 7
5. (take_image satellite0 star5 instrument1 image1)
   added: (have_image star5 image1)
   goals met: 2 of 7
6. (turn_to satellite0 planet9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet9)
   goals met: 2 of 7
7. (take_image satellite0 planet9 instrument1 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 3 of 7
8. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 7
9. (take_image satellite0 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 4 of 7
10. (turn_to satellite0 star6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star6)
   goals met: 4 of 7
11. (take_image satellite0 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 5 of 7
12. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 5 of 7
13. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 6 of 7
14. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   goals met: 7 of 7
